; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_4 ?v4 - type_2 ?v2 - type_1)
 	      (pred_3 ?v7 - object ?v2 - type_1)
	      (pred_2 ?v4 - type_2 ?v5 - type_3)
	      (pred_1 ?v4 - type_2 ?v7 - object ?v5 - type_3))

   (:action op_2
       :parameters  (?v4 - type_2 ?v6 ?v8 - type_1)
       :precondition (and  (pred_4 ?v4 ?v6))
       :effect (and  (pred_4 ?v4 ?v8)
		     (not (pred_4 ?v4 ?v6))))

   (:action op_3
       :parameters (?v4 - type_2 ?v3 - object ?v1 - type_1 ?v5 - type_3)
       :precondition  (and  (pred_3 ?v3 ?v1) (pred_4 ?v4 ?v1) (pred_2 ?v4 ?v5))
       :effect (and (pred_1 ?v4 ?v3 ?v5)
		    (not (pred_3 ?v3 ?v1)) 
		    (not (pred_2 ?v4 ?v5))))

   (:action op_1
       :parameters (?v4 - type_2 ?v3 - object ?v1 - type_1 ?v5 - type_3)
       :precondition  (and  (pred_1 ?v4 ?v3 ?v5) (pred_4 ?v4 ?v1))
       :effect (and (pred_3 ?v3 ?v1)
		    (pred_2 ?v4 ?v5)
		    (not (pred_1 ?v4 ?v3 ?v5)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_09 obj_11 - type_2
obj_05 obj_07 obj_10 obj_03 - type_3
obj_04 obj_06 obj_12 obj_08 - type_1
obj_02 obj_13 obj_01 - object)
(:init
(pred_4 obj_09 obj_08)
(pred_2 obj_09 obj_05)
(pred_2 obj_09 obj_07)
(pred_4 obj_11 obj_08)
(pred_2 obj_11 obj_10)
(pred_2 obj_11 obj_03)
(pred_3 obj_02 obj_04)
(pred_3 obj_13 obj_12)
(pred_3 obj_01 obj_12)
)
(:goal
(and
(pred_3 obj_02 obj_12)
(pred_3 obj_13 obj_12)
(pred_3 obj_01 obj_08)
)
)

(:constraints
  (always (not (pred_4 obj_09 obj_12)))
)
)

; plan
1. (op_2 obj_09 obj_08 obj_04)
   deleted: (pred_4 obj_09 obj_08)
   added: (pred_4 obj_09 obj_04)
   goals met: 1 of 3
2. (op_2 obj_11 obj_08 obj_12)
   deleted: (pred_4 obj_11 obj_08)
   added: (pred_4 obj_11 obj_12)
   goals met: 1 of 3
3. (op_3 obj_09 obj_02 obj_04 obj_07)
   deleted: (pred_3 obj_02 obj_04) (pred_2 obj_09 obj_07)
   added: (pred_1 obj_09 obj_02 obj_07)
   goals met: 1 of 3
4. (op_3 obj_11 obj_01 obj_12 obj_03)
   deleted: (pred_3 obj_01 obj_12) (pred_2 obj_11 obj_03)
   added: (pred_1 obj_11 obj_01 obj_03)
   goals met: 1 of 3
5. (op_2 obj_11 obj_12 obj_08)
   deleted: (pred_4 obj_11 obj_12)
   added: (pred_4 obj_11 obj_08)
   goals met: 1 of 3
6. (op_1 obj_09 obj_02 obj_04 obj_07)
   deleted: (pred_1 obj_09 obj_02 obj_07)
   added: (pred_3 obj_02 obj_04) (pred_2 obj_09 obj_07)
   goals met: 1 of 3
7. (op_1 obj_11 obj_01 obj_08 obj_03)
   deleted: (pred_1 obj_11 obj_01 obj_03)
   added: (pred_3 obj_01 obj_08) (pred_2 obj_11 obj_03)
   goals met: 2 of 3
8. (op_2 obj_11 obj_08 obj_04)
   deleted: (pred_4 obj_11 obj_08)
   added: (pred_4 obj_11 obj_04)
   goals met: 2 of 3
9. (op_3 obj_11 obj_02 obj_04 obj_03)
   deleted: (pred_3 obj_02 obj_04) (pred_2 obj_11 obj_03)
   added: (pred_1 obj_11 obj_02 obj_03)
   goals met: 2 of 3
10. (op_2 obj_11 obj_04 obj_12)
   deleted: (pred_4 obj_11 obj_04)
   added: (pred_4 obj_11 obj_12)
   goals met: 2 of 3
11. (op_1 obj_11 obj_02 obj_12 obj_03)
   deleted: (pred_1 obj_11 obj_02 obj_03)
   added: (pred_3 obj_02 obj_12) (pred_2 obj_11 obj_03)
   goals met: 3 of 3
